# 1) Случайная непрерывная величина A имеет равномерное распределение на промежутке (200, 800].
# Найдите ее среднее значение и дисперсию.

MX = (200 + 800) / 2
DX = (800 - 200) ** 2 / 12
print(f'среднее значение: {MX:g}')
print(f'дисперсия: {DX:g}')
